run/postLiquefaction/testCasePL/0/Uf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    seaBed
    {
        //type            fixedValue;
        //value           uniform (0 0 0);
        type            zeroGradient;
        //type            pressureInletOutletVelocity;
        //value           uniform (0 0 0);
    }
    frontBack
    {
        type            empty;
    }
    soilDomainBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "left|right"
    {
        type            splitCyclic;
    }
    r
    {
        type            splitCyclic;
    }
    l
    {
        type            splitCyclic;
    }

    

}


// ************************************************************************* //
