run/postLiquefaction/testCasePL/0/pE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    
    
    
    seaBed
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontBack
    {
        type            empty;
    }
    soilDomainBottom
    {
        type            zeroGradient;
    }
    
    "left|right"
    {
        type            splitCyclic;
    }
    
    r
    {
        type            splitCyclic;
    }
    
    l    
    {
        type            splitCyclic;
    }



}


// ************************************************************************* //
