run/postLiquefaction/testCasePL/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat raw;

sets
(
    Profile1
    {
        type            uniform;
        axis            z;
        start           (61.0375 0 0);
        end             (61.0375 0 -50);
        nPoints	 200;
    }
    


);


fields
(
    p
    pE
    tauXZ
    tauXZPrime2Mean
    phi
);


// ************************************************************************* //
